#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_disk.game_data_disk: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk]
google_compute_address.static_ip: Refreshing state... [id=projects/minecraft-abekoh/regions/asia-northeast1/addresses/minecraft-server-static-ip]
google_compute_network.vpc_network: Refreshing state... [id=projects/minecraft-abekoh/global/networks/minecraft-network]
google_storage_bucket.backup: Refreshing state... [id=minecraft-abekoh-backup]
google_compute_firewall.allow_minecraft: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-minecraft]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-icmp]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-ssh]
google_compute_instance.vm_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh]
google_compute_instance.bot_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.vm_instance has been changed
  ~ resource "google_compute_instance" "vm_instance" {
        id                   = "projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh"
      + labels               = {}
        name                 = "minecraft-abekoh"
      + resource_policies    = []
        tags                 = [
            "minecraft-server",
        ]
        # (15 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # google_compute_instance.bot_instance has been changed
  ~ resource "google_compute_instance" "bot_instance" {
        id                   = "projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot"
      + labels               = {}
        name                 = "minecraft-abekoh-discord-bot"
      + resource_policies    = []
      + tags                 = []
        # (15 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }
  # google_compute_disk.game_data_disk has been changed
  ~ resource "google_compute_disk" "game_data_disk" {
        id                        = "projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk"
      ~ last_attach_timestamp     = "2021-07-25T00:18:14.946-07:00" -> "2021-09-02T09:19:06.821-07:00"
      ~ last_detach_timestamp     = "2021-07-25T00:16:49.671-07:00" -> "2021-09-02T09:18:57.503-07:00"
        name                      = "game-data-disk"
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.allow_dynmap will be created
  + resource "google_compute_firewall" "allow_dynmap" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-dynmap"
      + network            = "minecraft-network"
      + priority           = 2000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "minecraft-server",
        ]

      + allow {
          + ports    = [
              + "8123",
            ]
          + protocol = "tcp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @abekoh, Action: `pull_request`, Working Directory: ``, Workflow: `validate & plan Terraform`*